module.exports = {
    IdentityIDCard: function(s) {
        var e = {
            11: "北京",
            12: "天津",
            13: "河北",
            14: "山西",
            15: "内蒙古",
            21: "辽宁",
            22: "吉林",
            23: "黑龙江 ",
            31: "上海",
            32: "江苏",
            33: "浙江",
            34: "安徽",
            35: "福建",
            36: "江西",
            37: "山东",
            41: "河南",
            42: "湖北 ",
            43: "湖南",
            44: "广东",
            45: "广西",
            46: "海南",
            50: "重庆",
            51: "四川",
            52: "贵州",
            53: "云南",
            54: "西藏 ",
            61: "陕西",
            62: "甘肃",
            63: "青海",
            64: "宁夏",
            65: "新疆",
            71: "台湾",
            81: "香港",
            82: "澳门",
            91: "国外 "
        }, r = /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|X)$/i, t = "", i = !0;
        if (s && r.test(s)) if (e[s.substr(0, 2)]) {
            if (18 == s.length) {
                s = s.split("");
                for (var d = [ 7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2 ], f = [ 1, 0, "X", 9, 8, 7, 6, 5, 4, 3, 2 ], l = 0, n = 0; n < 17; n++) l += s[n] * d[n];
                f[l % 11] != s[17] && (t = "您输入的身份证号不存在！", i = !1);
            }
        } else t = "您输入的身份证地址编码有误！", i = !1; else t = "您输入的身份证号格式有误！", i = !1;
        return {
            errorMess: t,
            isPass: i
        };
    }
};